trollmaster419/Flipper-Zero-ESP32-Port/applications_user/nRF24_jammer/nRF24_jammer.c
#include <furi.h>
#include <furi_hal.h>
#include <furi_hal_random.h>
#include <gui/gui.h>
#include <input/input.h>
#include <notification/notification_messages.h>
#include <nrf24.h>
#include <storage/storage.h>
#include <toolbox/stream/file_stream.h>
#include "fz_nrf24_jammer_icons.h"

#define TAG "nRF24_jammer_app"
#define HOLD_DELAY_MS 100

#define MAX_NRF24 4

typedef enum {
    MENU_BLUETOOTH,
    MENU_DRONE,
    MENU_WIFI,
    MENU_BLE,
    MENU_ZIGBEE,
    MENU_MISC,
    MENU_SETTINGS,
    MENU_COUNT
} MenuType;

typedef enum {
    WIFI_MODE_SELECT,
    WIFI_MODE_ALL,
    WIFI_MODE_COUNT
} WifiMode;

typedef enum {
    MISC_STATE_IDLE,
    MISC_STATE_SET_START,
    MISC_STATE_SET_STOP,
    MISC_STATE_ERROR,
    MISC_STATE_COUNT
} MiscState;

typedef enum {
    MISC_MODE_CHANNEL_SWITCHING,
    MISC_MODE_PACKET_SENDING,
    MISC_MODE_COUNT
} MiscMode;

typedef enum {
    BLUETOOTH_MODE_LIST,
    BLUETOOTH_MODE_RANDOM,
    BLUETOOTH_MODE_BRUTEFORCE,
    BLUETOOTH_MODE_COUNT
} BluetoothJamMethod;

typedef enum {
    DRONE_MODE_BRUTEFORCE,
    DRONE_MODE_RANDOM,
    DRONE_MODE_COUNT
} DroneJamMethod;

typedef enum {
    MODULES_MODE_SEPARATE,
    MODULES_MODE_TOGETHER,
    MODULES_MODE_COUNT
} ModulesMode;

typedef enum {
    SETTINGS_ITEM_SPI_MODE,
    SETTINGS_ITEM_MODULES_MODE,
    SETTINGS_ITEM_BLUETOOTH_METHOD,
    SETTINGS_ITEM_DRONE_METHOD,
    SETTINGS_ITEM_LOGO,
    SETTINGS_ITEM_COUNT
} SettingsItem;

typedef enum {
    SHOW_LOGO,
    HIDE_LOGO,
    LOGO_COUNT
} Is_Logo;

typedef enum {
    SPI_MODE_DEFAULT,  // CS on PA4 (standard standalone NRF24)
    SPI_MODE_EXTRA,    // CS on PC3 (2-in-1 NRF24+CC1101 module)
    SPI_MODE_COUNT
} SpiMode;

typedef struct {
    FuriMutex* mutex;
    NotificationApp* notifications;
    FuriThread* thread;
    ViewPort* view_port;
    
    bool is_running;
    bool is_stop;
    bool wifi_menu_active;
    bool show_jamming_started;
    bool wifi_channel_select;
    bool is_modules_connected;
    bool settings_menu_active;
    bool ble_menu_active;
    uint8_t ble_selected;
    
    MenuType current_menu;
    WifiMode wifi_mode;
    MiscState misc_state;
    MiscMode misc_mode;
    uint8_t wifi_channel;
    uint8_t misc_start;
    uint8_t misc_stop;

    SpiMode spi_mode;
    ModulesMode modules_mode;
    BluetoothJamMethod bluetooth_jam_method;
    DroneJamMethod drone_jam_method;
    uint8_t is_logo;
    
    SettingsItem selected_setting_item;

    InputKey held_key;
    uint32_t hold_counter;
    uint32_t last_up_press_time;
    uint32_t last_down_press_time;
    uint8_t up_press_count;
    uint8_t down_press_count;
    uint8_t len_modules;
} PluginState;

typedef enum {
    EVENT_TICK,
    EVENT_KEY,
} EventType;

typedef struct {
    EventType type;
    InputEvent input;
} PluginEvent;

const NotificationSequence error_sequence = {
    &message_red_255,
    &message_vibro_on,
    &message_delay_250,
    &message_vibro_off,
    &message_red_0,
    NULL,
};

nrf24_device_t nrf24_dev[MAX_NRF24];

static const uint8_t bluetooth_channels[] = {32, 34, 46, 48, 50, 52, 0, 1, 2, 4, 6, 8, 22, 24, 26, 28, 30, 74, 76, 78, 80};
static const uint8_t ble_channels[] = {2, 26, 80};
static const uint8_t zigbee_channels[] = {11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26};

static const int ble_channels_count = sizeof(ble_channels) / sizeof(ble_channels[0]);
static const int zigbee_channels_count = sizeof(zigbee_channels) / sizeof(zigbee_channels[0]);

static void settings_save(PluginState* state) {
    Storage* storage = furi_record_open(RECORD_STORAGE);
    Stream* stream = file_stream_alloc(storage);
    
    storage_simply_mkdir(storage, "/ext/apps_data/fz_nrf24_jammer");

    if(file_stream_open(stream, "/ext/apps_data/fz_nrf24_jammer/settings.txt", FSAM_WRITE, FSOM_CREATE_ALWAYS)) {
        char buffer[128];
        snprintf(buffer, sizeof(buffer), "spi_mode=%d\n", state->spi_mode);
        stream_write(stream, (uint8_t*)buffer, strlen(buffer));
        snprintf(buffer, sizeof(buffer), "modules_mode=%d\n", state->modules_mode);
        stream_write(stream, (uint8_t*)buffer, strlen(buffer));
        snprintf(buffer, sizeof(buffer), "bluetooth_jam_method=%d\n", state->bluetooth_jam_method);
        stream_write(stream, (uint8_t*)buffer, strlen(buffer));
        snprintf(buffer, sizeof(buffer), "drone_jam_method=%d\n", state->drone_jam_method);
        stream_write(stream, (uint8_t*)buffer, strlen(buffer));
        snprintf(buffer, sizeof(buffer), "logo=%d\n", state->is_logo);
        stream_write(stream, (uint8_t*)buffer, strlen(buffer));
        file_stream_close(stream);
    }
    
    file_stream_close(stream);
    stream_free(stream);
    furi_record_close(RECORD_STORAGE);
}

static void settings_load(PluginState* state) {
    Storage* storage = furi_record_open(RECORD_STORAGE);
    Stream* stream = file_stream_alloc(storage);
    
    state->spi_mode = SPI_MODE_DEFAULT;
    state->modules_mode = MODULES_MODE_SEPARATE;
    state->bluetooth_jam_method = BLUETOOTH_MODE_LIST;
    state->drone_jam_method = DRONE_MODE_BRUTEFORCE;
    state->is_logo = SHOW_LOGO;
    
    if(file_stream_open(stream, "/ext/apps_data/fz_nrf24_jammer/settings.txt", FSAM_READ, FSOM_OPEN_EXISTING)) {
        size_t file_size = stream_size(stream);
        if(file_size > 0 && file_size < 1024) {
            uint8_t* file_buf = malloc(file_size + 1);
            memset(file_buf, 0, file_size + 1);
            size_t bytes_read = stream_read(stream, file_buf, file_size);
            
            if(bytes_read == file_size) {
                char* content = (char*)file_buf;
                char* line = strtok(content, "\n");
                
                while(line != NULL) {
                    if(strstr(line, "spi_mode=") != NULL) {
                        char* value = strchr(line, '=');
                        if(value != NULL) {
                            value++;
                            state->spi_mode = atoi(value);
                            if(state->spi_mode >= SPI_MODE_COUNT)
                                state->spi_mode = SPI_MODE_DEFAULT;
                        }
                    }
                    else if(strstr(line, "modules_mode=") != NULL) {
                        char* value = strchr(line, '=');
                        if(value != NULL) {
                            value++;
                            state->modules_mode = atoi(value);
                            if(state->modules_mode >= MODULES_MODE_COUNT) 
                                state->modules_mode = MODULES_MODE_SEPARATE;
                        }
                    }
                    else if(strstr(line, "bluetooth_jam_method=") != NULL) {
                        char* value = strchr(line, '=');
                        if(value != NULL) {
                            value++;
                            state->bluetooth_jam_method = atoi(value);
                            if(state->bluetooth_jam_method >= BLUETOOTH_MODE_COUNT) 
                                state->bluetooth_jam_method = BLUETOOTH_MODE_LIST;
                        }
                    }
                    else if(strstr(line, "drone_jam_method=") != NULL) {
                        char* value = strchr(line, '=');
                        if(value != NULL) {
                            value++;
                            state->drone_jam_method = atoi(value);
                            if(state->drone_jam_method >= DRONE_MODE_COUNT) 
                                state->drone_jam_method = DRONE_MODE_BRUTEFORCE;
                        }
                    }
                    else if(strstr(line, "logo=") != NULL) {
                        char* value = strchr(line, '=');
                        if(value != NULL) {
                            value++;
                            state->is_logo = atoi(value);
                            if(state->is_logo >= LOGO_COUNT) 
                                state->is_logo = SHOW_LOGO;
                        }
                    }
                    line = strtok(NULL, "\n");
                }
            }
            
            free(file_buf);
        }
        file_stream_close(stream);
    }
    
    stream_free(stream);
    furi_record_close(RECORD_STORAGE);
}

static inline bool is_separate_mode(PluginState* state) {
    return state->modules_mode == MODULES_MODE_SEPARATE;
}

static void start_const_carrier(uint8_t len_modules) {
    for(uint8_t i = 0; i < len_modules; i++) {
        nrf24_startConstCarrier(&nrf24_dev[i], 6, 45);
    }
}

static void stop_const_carrier(uint8_t len_modules) {
    for(uint8_t i = 0; i < len_modules; i++) {
        nrf24_stopConstCarrier(&nrf24_dev[i]);
    }
}

static void write_channel_random_separate(uint8_t limit, uint8_t len_modules) {
    limit++;
    for(uint8_t i = 0; i < len_modules; i++) {
        nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, (furi_hal_random_get() % limit));
    }
}

static void write_channel_random(uint8_t limit, uint8_t len_modules) {
    limit++;
    uint8_t ch = (furi_hal_random_get() % limit);
    for(uint8_t i = 0; i < len_modules; i++) {
        nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, ch);
    }
}

static void write_channel_all_separate(uint8_t limit, uint8_t len_modules, uint8_t start) {
    for(uint8_t ch = start; ch <= limit; ch++) {
        uint8_t i = ch % len_modules;
        nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, ch);
    }
}

static void write_channel_all(uint8_t limit, uint8_t len_modules, uint8_t start) {
    for(uint8_t ch = start; ch <= limit; ch++) {
        for(uint8_t i = 0; i < len_modules; i++) {
            nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, ch);
        }
    }
}

static void write_channel_list_separate(const uint8_t *list, uint8_t size_list, uint8_t len_modules) {
    for(uint8_t ch = 0; ch < size_list; ch++) {
        uint8_t i = ch % len_modules;
        nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, list[ch]);
    }
}

static void write_channel_list(const uint8_t *list, uint8_t size_list, uint8_t len_modules) {
    for(uint8_t ch = 0; ch < size_list; ch++) {
        for(uint8_t i = 0; i < len_modules; i++) {
            nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, list[ch]);
        }
    }
}

static void jam_bluetooth(PluginState* state) {
    start_const_carrier(state->len_modules);

