trollmaster419/Flipper-Zero-ESP32-Port/applications_user/nRF24_jammer/nRF24_jammer.c
    while(!state->is_stop) {
        if(is_separate_mode(state)) {
            if(state->bluetooth_jam_method == BLUETOOTH_MODE_LIST) {
                write_channel_list_separate(bluetooth_channels, sizeof(bluetooth_channels), state->len_modules);
            } else if(state->bluetooth_jam_method == BLUETOOTH_MODE_RANDOM) {
                write_channel_random_separate(80, state->len_modules);
            } else if(state->bluetooth_jam_method == BLUETOOTH_MODE_BRUTEFORCE) {
                write_channel_all_separate(80, state->len_modules, 0);
            }
        } else {
            if(state->bluetooth_jam_method == BLUETOOTH_MODE_LIST) {
                write_channel_list(bluetooth_channels, sizeof(bluetooth_channels), state->len_modules);
            } else if(state->bluetooth_jam_method == BLUETOOTH_MODE_RANDOM) {
                write_channel_random(80, state->len_modules);
            } else if(state->bluetooth_jam_method == BLUETOOTH_MODE_BRUTEFORCE) {
                write_channel_all(80, state->len_modules, 0);
            }
        }
    }
    
    stop_const_carrier(state->len_modules);
}

static void jam_drone(PluginState* state) {
    start_const_carrier(state->len_modules);
    
    while(!state->is_stop) {
        if(is_separate_mode(state)) {
            if(state->drone_jam_method == DRONE_MODE_BRUTEFORCE) {
                write_channel_all_separate(125, state->len_modules, 0);
            } else if(state->drone_jam_method == DRONE_MODE_RANDOM) {
                write_channel_random_separate(125, state->len_modules);
            }
        } else {
            if(state->drone_jam_method == DRONE_MODE_BRUTEFORCE) {
                write_channel_all(125, state->len_modules, 0);
            } else if(state->drone_jam_method == DRONE_MODE_RANDOM) {
                write_channel_random(125, state->len_modules);
            }
        }
    }

    stop_const_carrier(state->len_modules);
}

static void jam_ble_advertising(PluginState* state) {
    uint8_t mac[] = {0xFF, 0xFF};
    uint8_t tx[3] = {W_TX_PAYLOAD_NOACK, mac[0], mac[1]};

    for(uint8_t i = 0; i < state->len_modules; i++) {
        nrf24_configure(&nrf24_dev[i], 2, mac, mac, 2, 1, true, true);
        nrf24_set_txpower(&nrf24_dev[i], 6);
        nrf24_set_tx_mode(&nrf24_dev[i]);
    }
    while(!state->is_stop) {
        if(is_separate_mode(state)) {
            for(uint8_t ch = 0; ch < ble_channels_count; ch++) {
                uint8_t i = ch % state->len_modules;
                nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, ble_channels[ch]);
                nrf24_spi_trx(&nrf24_dev[i], tx, NULL, 3, nrf24_TIMEOUT);
            }
        } else {
            for(uint8_t ch = 0; ch < ble_channels_count; ch++) {
                for(uint8_t i = 0; i < state->len_modules; i++) {
                    nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, ble_channels[ch]);
                    nrf24_spi_trx(&nrf24_dev[i], tx, NULL, sizeof(tx), nrf24_TIMEOUT);
                }
            }
        }
    }
}

static void jam_ble_data(PluginState* state) {
    start_const_carrier(state->len_modules);

    while(!state->is_stop) {
        if(is_separate_mode(state)) {
            for (uint8_t ch = 2; ch <= 80; ch+=2){
                uint8_t i = ch % state->len_modules;
                nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, ch);
            }
        } else {
            for (uint8_t ch = 2; ch <= 80; ch+=2){
                for (uint8_t i = 0; i < state->len_modules; i++){
                    nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, ch);
                }
            }
        }
    }
    
    stop_const_carrier(state->len_modules);
}

static void jam_misc(PluginState* state) {
    if(state->misc_mode == MISC_MODE_CHANNEL_SWITCHING) {
        start_const_carrier(state->len_modules);
        
        while(!state->is_stop) {
            if(is_separate_mode(state)) {
                write_channel_all_separate(state->misc_stop, state->len_modules, state->misc_start);
            } else {
                write_channel_all(state->misc_stop, state->len_modules, state->misc_start);
            }
        }
    
        stop_const_carrier(state->len_modules);
    } else {
        uint8_t mac[] = {0xFF, 0xFF};
        uint8_t tx[3] = {W_TX_PAYLOAD_NOACK, mac[0], mac[1]};

        for(uint8_t i = 0; i < state->len_modules; i++) {
            nrf24_configure(&nrf24_dev[i], 2, mac, mac, 2, state->misc_start, true, true);
            nrf24_set_txpower(&nrf24_dev[i], 6);
            nrf24_set_tx_mode(&nrf24_dev[i]);
        }

        while(!state->is_stop) {
            if(is_separate_mode(state)) {
                for(uint8_t ch = state->misc_start; ch <= state->misc_stop; ch++) {
                    uint8_t i = ch % state->len_modules;
                    nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, ch);
                    nrf24_spi_trx(&nrf24_dev[i], tx, NULL, sizeof(tx), nrf24_TIMEOUT);
                }
            } else {
                for(uint8_t ch = state->misc_start; ch <= state->misc_stop; ch++) {
                    for(uint8_t i = 0; i < state->len_modules; i++) {
                        nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, ch);
                        nrf24_spi_trx(&nrf24_dev[i], tx, NULL, sizeof(tx), nrf24_TIMEOUT);
                    }
                }
            }
        }
    }
}

static void jam_wifi(PluginState* state) {
    uint8_t mac[] = {0xFF, 0xFF};
    uint8_t tx[3] = {W_TX_PAYLOAD_NOACK, mac[0], mac[1]};

    for(uint8_t i = 0; i < state->len_modules; i++) {
        nrf24_configure(&nrf24_dev[i], 2, mac, mac, 2, state->misc_start, true, true);
        nrf24_set_txpower(&nrf24_dev[i], 6);
        nrf24_set_tx_mode(&nrf24_dev[i]);
    }

    while(!state->is_stop) {
        if(state->wifi_mode == WIFI_MODE_ALL) {
            if(is_separate_mode(state)) {
                for(uint8_t channel = 0; channel <= 13 && !state->is_stop; channel++) {
                    for(uint8_t ch = (channel * 5) + 1; ch <= (channel * 5) + 23 && !state->is_stop; ch++) {
                        uint8_t i = ch % state->len_modules;
                        nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, ch);
                        nrf24_spi_trx(&nrf24_dev[i], tx, NULL, sizeof(tx), nrf24_TIMEOUT);
                    }
                }
            } else {
                for(uint8_t channel = 0; channel <= 13 && !state->is_stop; channel++) {
                    for(uint8_t ch = (channel * 5) + 1; ch <= (channel * 5) + 23 && !state->is_stop; ch++) {
                        for(uint8_t i = 0; i < state->len_modules; i++) {
                            nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, ch);
                            nrf24_spi_trx(&nrf24_dev[i], tx, NULL, sizeof(tx), nrf24_TIMEOUT);
                        }
                   }
                }
            }
        } else {
            uint8_t wifi_tmp = state->wifi_channel - 1;
            if(is_separate_mode(state)) {
                for(uint8_t ch = (wifi_tmp * 5) + 1; ch <= (wifi_tmp * 5) + 23 && !state->is_stop; ch++) {
                    uint8_t i = ch % state->len_modules;
                    nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, ch);
                    nrf24_spi_trx(&nrf24_dev[i], tx, NULL, sizeof(tx), nrf24_TIMEOUT);
                }
            } else {
                for(uint8_t ch = (wifi_tmp * 5) + 1; ch <= (wifi_tmp * 5) + 23 && !state->is_stop; ch++) {
                    for(uint8_t i = 0; i < state->len_modules; i++) {
                        nrf24_write_reg(&nrf24_dev[i], REG_RF_CH, ch);
                        nrf24_spi_trx(&nrf24_dev[i], tx, NULL, sizeof(tx), nrf24_TIMEOUT);
                    }
                }
            }
        }
    }
}

static void jam_zigbee(PluginState* state) {
    uint8_t mac[] = {0xFF, 0xFF};
    uint8_t tx[3] = {W_TX_PAYLOAD_NOACK, mac[0], mac[1]};

    for(uint8_t i = 0; i < state->len_modules; i++) {
        nrf24_configure(&nrf24_dev[i], 2, mac, mac, 2, state->misc_start, true, true);
        nrf24_set_txpower(&nrf24_dev[i], 6);
        nrf24_set_tx_mode(&nrf24_dev[i]);
    }

