trollmaster419/Flipper-Zero-ESP32-Port/applications_user/nRF24_jammer/nRF24_jammer.c
    while(!state->is_stop) {
        if(is_separate_mode(state)) {
            for(uint8_t i = 0; i < zigbee_channels_count && !state->is_stop; i++) {
                for(uint8_t ch = 4 + 5 * (zigbee_channels[i] - 11); ch <= (4 + 5 * (zigbee_channels[i] - 11)) + 2 && !state->is_stop; ch++) {
                    uint8_t k = ch % state->len_modules;
                    nrf24_write_reg(&nrf24_dev[k], REG_RF_CH, ch);
                    nrf24_spi_trx(&nrf24_dev[k], tx, NULL, sizeof(tx), nrf24_TIMEOUT);
                }
            }
        } else {
            for(uint8_t i = 0; i < zigbee_channels_count && !state->is_stop; i++) {
                for(uint8_t ch = 4 + 5 * (zigbee_channels[i] - 11); ch <= (4 + 5 * (zigbee_channels[i] - 11)) + 2 && !state->is_stop; ch++) {
                    for(uint8_t k = 0; k < state->len_modules; k++) {
                        nrf24_write_reg(&nrf24_dev[k], REG_RF_CH, ch);
                        nrf24_spi_trx(&nrf24_dev[k], tx, NULL, sizeof(tx), nrf24_TIMEOUT);
                    }
                }
            }
        }
    }
}

static int32_t jam_thread(void* ctx) {
    PluginState* state = ctx;
    state->is_running = true;
    state->is_stop = false;

    switch(state->current_menu) {
        case MENU_BLUETOOTH: jam_bluetooth(state); break;
        case MENU_DRONE: jam_drone(state); break;
        case MENU_WIFI: jam_wifi(state); break;
        case MENU_BLE:
            if(state->ble_selected == 0)
                jam_ble_advertising(state);
            else
                jam_ble_data(state);
            break;
        case MENU_ZIGBEE: jam_zigbee(state); break;
        case MENU_MISC: jam_misc(state); break;
        case MENU_SETTINGS:
        case MENU_COUNT:
            break;
        default:
            break;
    }

    state->is_running = false;
    if(state->current_menu == MENU_MISC) {
        state->show_jamming_started = false;
    }
    return 0;
}

static void render_settings_menu(Canvas* canvas, PluginState* state) {
    const uint8_t item_height = 12;
    const uint8_t start_y = 0;
    const uint8_t visible_items = 5;
    const uint8_t total_items = SETTINGS_ITEM_COUNT;
    
    static uint8_t scroll_offset = 0;
    
    if(state->selected_setting_item < scroll_offset) {
        scroll_offset = state->selected_setting_item;
    } else if(state->selected_setting_item >= scroll_offset + visible_items) {
        scroll_offset = state->selected_setting_item - visible_items + 1;
    }
    
    canvas_set_font(canvas, FontSecondary);
    
    for(uint8_t i = 0; i < visible_items && i + scroll_offset < total_items; i++) {
        uint8_t y = start_y + (i * item_height);
        uint8_t item_index = i + scroll_offset;
        
        if(item_index == state->selected_setting_item) {
            canvas_draw_frame(canvas, 2, y, 124, item_height);
        }
        
        switch(item_index) {
            case SETTINGS_ITEM_SPI_MODE:
                canvas_draw_str(canvas, 4, y + 9, "SPI Pin:");
                if(state->spi_mode == SPI_MODE_DEFAULT) {
                    canvas_draw_str(canvas, 60, y + 9, "Default 4");
                } else {
                    canvas_draw_str(canvas, 60, y + 9, "Extra 7");
                }
                break;

            case SETTINGS_ITEM_MODULES_MODE:
                canvas_draw_str(canvas, 4, y + 9, "Modules:");
                if(state->modules_mode == MODULES_MODE_SEPARATE) {
                    canvas_draw_str(canvas, 60, y + 9, "Separate");
                } else {
                    canvas_draw_str(canvas, 60, y + 9, "Together");
                }
                break;
                
            case SETTINGS_ITEM_BLUETOOTH_METHOD:
                canvas_draw_str(canvas, 4, y + 9, "Bluetooth:");
                switch(state->bluetooth_jam_method) {
                    case BLUETOOTH_MODE_LIST:
                        canvas_draw_str(canvas, 60, y + 9, "List");
                        break;
                    case BLUETOOTH_MODE_RANDOM:
                        canvas_draw_str(canvas, 60, y + 9, "Random");
                        break;
                    case BLUETOOTH_MODE_BRUTEFORCE:
                        canvas_draw_str(canvas, 60, y + 9, "Bruteforce");
                        break;
                    case BLUETOOTH_MODE_COUNT:
                    default:
                        canvas_draw_str(canvas, 60, y + 9, "List");
                        break;
                }
                break;
                
            case SETTINGS_ITEM_DRONE_METHOD:
                canvas_draw_str(canvas, 4, y + 9, "Drone:");
                switch(state->drone_jam_method) {
                    case DRONE_MODE_BRUTEFORCE:
                        canvas_draw_str(canvas, 60, y + 9, "Bruteforce");
                        break;
                    case DRONE_MODE_RANDOM:
                        canvas_draw_str(canvas, 60, y + 9, "Random");
                        break;
                    case DRONE_MODE_COUNT:
                    default:
                        canvas_draw_str(canvas, 60, y + 9, "Bruteforce");
                        break;
                }
                break;

            case SETTINGS_ITEM_LOGO:
                canvas_draw_str(canvas, 4, y + 9, "Logo:");
                switch(state->is_logo) {
                    case SHOW_LOGO:
                        canvas_draw_str(canvas, 60, y + 9, "Show");
                        break;
                    case HIDE_LOGO:
                        canvas_draw_str(canvas, 60, y + 9, "Hide");
                        break;
                    case LOGO_COUNT:
                    default:
                        canvas_draw_str(canvas, 60, y + 9, "Show");
                        break;
                }
                break;
                
            default:
                break;
        }
    }
}

static void render_settings_screen(Canvas* canvas, PluginState* state) {
    char buffer[32];
    canvas_set_font(canvas, FontPrimary);
    
    if(state->misc_state == MISC_STATE_SET_START) {
        snprintf(buffer, sizeof(buffer), "Start channel: %d", state->misc_start);
        canvas_draw_str_aligned(canvas, 64, 20, AlignCenter, AlignCenter, buffer);
        
