trollmaster419/Flipper-Zero-ESP32-Port/applications_user/nRF24_jammer/nRF24_jammer.c
        canvas_set_font(canvas, FontSecondary);
        if(state->misc_mode == MISC_MODE_CHANNEL_SWITCHING) {
            snprintf(buffer, sizeof(buffer), "Mode: Channel Switching");
        } else {
            snprintf(buffer, sizeof(buffer), "Mode: Packet Sending");
        }
        canvas_draw_str_aligned(canvas, 64, 30, AlignCenter, AlignCenter, buffer);
        
        canvas_draw_str_aligned(canvas, 64, 40, AlignCenter, AlignCenter, "Press OK to set stop");
    } else if(state->misc_state == MISC_STATE_SET_STOP) {
        snprintf(buffer, sizeof(buffer), "Start: %d Stop: %d", state->misc_start, state->misc_stop);
        canvas_draw_str_aligned(canvas, 64, 20, AlignCenter, AlignCenter, buffer);
        
        canvas_set_font(canvas, FontSecondary);
        if(state->misc_mode == MISC_MODE_CHANNEL_SWITCHING) {
            snprintf(buffer, sizeof(buffer), "Mode: Channel Switching");
        } else {
            snprintf(buffer, sizeof(buffer), "Mode: Packet Sending");
        }
        canvas_draw_str_aligned(canvas, 64, 30, AlignCenter, AlignCenter, buffer);
        
        if(state->misc_stop > state->misc_start) {
            canvas_draw_str_aligned(canvas, 64, 40, AlignCenter, AlignCenter, "Press OK to start");
        } else {
            canvas_draw_str_aligned(canvas, 64, 40, AlignCenter, AlignCenter, "Error: Start < Stop");
        }
    } else if(state->misc_state == MISC_STATE_ERROR) {
        canvas_set_font(canvas, FontPrimary);
        canvas_draw_str_aligned(canvas, 64, 20, AlignCenter, AlignCenter, "Invalid range");
        canvas_set_font(canvas, FontSecondary);
        canvas_draw_str_aligned(canvas, 64, 35, AlignCenter, AlignCenter, "Start must be < Stop");
    } else if(state->misc_state == MISC_STATE_IDLE) {
    } else if(state->misc_state == MISC_STATE_COUNT) {
    }
}

static void render_wifi_channel_select(Canvas* canvas, PluginState* state) {
    char buffer[32];
    canvas_set_font(canvas, FontPrimary);
    snprintf(buffer, sizeof(buffer), "WiFi channel: %d", state->wifi_channel);
    canvas_draw_str_aligned(canvas, 64, 32, AlignCenter, AlignCenter, buffer);
    canvas_set_font(canvas, FontSecondary);
    canvas_draw_str_aligned(canvas, 64, 45, AlignCenter, AlignCenter, "Press OK to start");
}

static void render_wifi_menu(Canvas* canvas, PluginState* state) {
    if(state->wifi_mode == WIFI_MODE_ALL) {
        canvas_draw_icon(canvas, 0, 0, &I_wifi_all);
    } else {
        canvas_draw_icon(canvas, 0, 0, &I_wifi_select);
    }
}

static void render_active_jamming(Canvas* canvas, MenuType menu) {
    switch(menu) {
        case MENU_BLUETOOTH: canvas_draw_icon(canvas, 0, 0, &I_bluetooth_jam); break;
        case MENU_DRONE: canvas_draw_icon(canvas, 0, 0, &I_drone_jam); break;
        case MENU_WIFI: canvas_draw_icon(canvas, 0, 0, &I_wifi_jam); break;
        case MENU_BLE: canvas_draw_icon(canvas, 0, 0, &I_ble_jam); break;
        case MENU_ZIGBEE: canvas_draw_icon(canvas, 0, 0, &I_zigbee_jam); break;
        case MENU_MISC:
        case MENU_SETTINGS:
        case MENU_COUNT:
        default:
            break;
    }
}

static void render_menu_icons(Canvas* canvas, MenuType menu) {
    switch(menu) {
        case MENU_BLUETOOTH: canvas_draw_icon(canvas, 0, 0, &I_bluetooth_jammer); break;
        case MENU_DRONE: canvas_draw_icon(canvas, 0, 0, &I_drone_jammer); break;
        case MENU_WIFI: canvas_draw_icon(canvas, 0, 0, &I_wifi_jammer); break;
        case MENU_BLE: canvas_draw_icon(canvas, 0, 0, &I_ble_jammer); break;
        case MENU_ZIGBEE: canvas_draw_icon(canvas, 0, 0, &I_zigbee_jammer); break;
        case MENU_MISC: canvas_draw_icon(canvas, 0, 0, &I_misc_jammer); break;
        case MENU_SETTINGS: canvas_draw_icon(canvas, 0, 0, &I_settings); break;
        case MENU_COUNT:
        default:
            break;
    }
}

static void render_logo(Canvas* canvas, void* ctx){
    PluginState* state = ctx;
    if (state->is_logo == SHOW_LOGO)
        canvas_draw_icon(canvas, 0, 0, &I_logo);
}

static void render_callback(Canvas* canvas, void* ctx) {
    PluginState* state = ctx;
    canvas_clear(canvas);
    canvas_draw_frame(canvas, 0, 0, 128, 64);
    
    if(!state->is_modules_connected) {
        char buffer[32];
        canvas_set_font(canvas, FontPrimary);

        canvas_draw_str_aligned(canvas, 64, 10, AlignCenter, AlignTop, "Module Status");

        snprintf(buffer, sizeof(buffer), "Connected: %d module(s)", state->len_modules);
        canvas_draw_str_aligned(canvas, 64, 25, AlignCenter, AlignTop, buffer);

        if(state->len_modules == 0) {
            canvas_set_font(canvas, FontSecondary);
            canvas_draw_str_aligned(canvas, 64, 40, AlignCenter, AlignTop, "No modules detected");
            canvas_draw_str_aligned(canvas, 64, 50, AlignCenter, AlignTop, "Please connect module");
        }
    }
    else if(state->current_menu == MENU_MISC && state->show_jamming_started) {
        canvas_set_font(canvas, FontPrimary);
        canvas_draw_str_aligned(canvas, 64, 32, AlignCenter, AlignCenter, "Jamming started");
    }
    else if(state->is_running) {
        render_active_jamming(canvas, state->current_menu);
    }
    else if(state->current_menu == MENU_SETTINGS) {
        if(state->settings_menu_active) {
            render_settings_menu(canvas, state);
        } else {
            render_menu_icons(canvas, state->current_menu);
        }
    }
    else if(state->current_menu == MENU_MISC && state->misc_state != MISC_STATE_IDLE) {
        render_settings_screen(canvas, state);
    }
    else if(state->current_menu == MENU_WIFI) {
        if(state->wifi_menu_active) {
            if(state->wifi_channel_select) {
                render_wifi_channel_select(canvas, state);
            } else {
                render_wifi_menu(canvas, state);
            }
        } else {
            render_menu_icons(canvas, state->current_menu);
        }
    }
    else if(state->current_menu == MENU_BLE) {
        if(state->ble_menu_active) {
            if(state->ble_selected == 0) {
                canvas_draw_icon(canvas, 0, 0, &I_advertising_channels);
            } else {
                canvas_draw_icon(canvas, 0, 0, &I_data_channels);
            }
        } else {
            render_menu_icons(canvas, state->current_menu);
        }
    }
    else {
        render_menu_icons(canvas, state->current_menu);
    }
}

static void input_callback(InputEvent* event, void* ctx) {
    FuriMessageQueue* queue = ctx;
    PluginEvent plugin_event = {.type = EVENT_KEY, .input = *event};
    furi_message_queue_put(queue, &plugin_event, FuriWaitForever);
}

static void handle_settings_input(PluginState* state, InputKey key, bool is_hold) {
    uint8_t increment = 1;

