trollmaster419/Flipper-Zero-ESP32-Port/applications_user/nRF24_jammer/nRF24_jammer.c
    if(!is_hold) {
        if(key == InputKeyUp) {
            uint32_t now = furi_get_tick();
            if(now - state->last_up_press_time < 200) {
                state->up_press_count++;
            } else {
                state->up_press_count = 1;
            }
            state->last_up_press_time = now;
            
            if(state->up_press_count == 2) increment = 9;
            else if(state->up_press_count >= 3) increment = 90;
        } 
        else if(key == InputKeyDown) {
            uint32_t now = furi_get_tick();
            if(now - state->last_down_press_time < 200) {
                state->down_press_count++;
            } else {
                state->down_press_count = 1;
            }
            state->last_down_press_time = now;
            
            if(state->down_press_count == 2) increment = 9;
            else if(state->down_press_count >= 3) increment = 90;
        }
    }

    if(key == InputKeyUp) {
        if(state->misc_state == MISC_STATE_SET_START) {
            if(state->misc_start + increment <= 125) {
                state->misc_start += increment;
            }
        } else if(state->misc_state == MISC_STATE_SET_STOP) {
            if(state->misc_stop + increment <= 125) {
                state->misc_stop += increment;
            }
        }
    } 
    else if(key == InputKeyDown) {
        if(state->misc_state == MISC_STATE_SET_START) {
            if(state->misc_start >= increment) {
                state->misc_start -= increment;
            }
        } else if(state->misc_state == MISC_STATE_SET_STOP) {
            if(state->misc_stop >= increment) {
                state->misc_stop -= increment;
            }
        }
    }

    if(state->misc_state == MISC_STATE_SET_STOP && state->misc_stop <= state->misc_start) {
        if(state->misc_start + 1 <= 125) {
            state->misc_stop = state->misc_start + 1;
        }
    }
}

static void handle_menu_input(PluginState* state, InputKey key) {
    if(key == InputKeyUp || key == InputKeyRight) {
        state->current_menu = (state->current_menu + 1) % MENU_COUNT;
    } else if(key == InputKeyDown || key == InputKeyLeft) {
        state->current_menu = (state->current_menu == 0) ? 
            (MENU_COUNT - 1) : (state->current_menu - 1);
    }

    state->misc_state = MISC_STATE_IDLE;
    state->wifi_menu_active = false;
    state->wifi_channel_select = false;
    state->settings_menu_active = false;
    state->ble_menu_active = false;
    state->selected_setting_item = SETTINGS_ITEM_SPI_MODE;
}

static void handle_settings_menu_input(PluginState* state, InputKey key) {
    switch(key) {
        case InputKeyUp:
            if(state->selected_setting_item == 0) {
                state->selected_setting_item = SETTINGS_ITEM_COUNT - 1;
            } else {
                state->selected_setting_item--;
            }
            break;
        case InputKeyDown:
            state->selected_setting_item = (state->selected_setting_item + 1) % SETTINGS_ITEM_COUNT;
            break;
        case InputKeyLeft:
            if(state->selected_setting_item == SETTINGS_ITEM_SPI_MODE) {
                if(state->spi_mode == 0) {
                    state->spi_mode = SPI_MODE_COUNT - 1;
                } else {
                    state->spi_mode--;
                }
            } else if(state->selected_setting_item == SETTINGS_ITEM_MODULES_MODE) {
                if(state->modules_mode == 0) {
                    state->modules_mode = MODULES_MODE_COUNT - 1;
                } else {
                    state->modules_mode--;
                }
            } else if(state->selected_setting_item == SETTINGS_ITEM_BLUETOOTH_METHOD) {
                if(state->bluetooth_jam_method == 0) {
                    state->bluetooth_jam_method = BLUETOOTH_MODE_COUNT - 1;
                } else {
                    state->bluetooth_jam_method--;
                }
            } else if(state->selected_setting_item == SETTINGS_ITEM_DRONE_METHOD) {
                if(state->drone_jam_method == 0) {
                    state->drone_jam_method = DRONE_MODE_COUNT - 1;
                } else {
                    state->drone_jam_method--;
                }
            } else if(state->selected_setting_item == SETTINGS_ITEM_LOGO) {
                if(state->is_logo == 0) {
                    state->is_logo = LOGO_COUNT - 1;
                } else {
                    state->is_logo--;
                }
            }
            break;
        case InputKeyRight:
            if(state->selected_setting_item == SETTINGS_ITEM_SPI_MODE) {
                state->spi_mode = (state->spi_mode + 1) % SPI_MODE_COUNT;
            } else if(state->selected_setting_item == SETTINGS_ITEM_MODULES_MODE) {
                state->modules_mode = (state->modules_mode + 1) % MODULES_MODE_COUNT;
            } else if(state->selected_setting_item == SETTINGS_ITEM_BLUETOOTH_METHOD) {
                state->bluetooth_jam_method = (state->bluetooth_jam_method + 1) % BLUETOOTH_MODE_COUNT;
            } else if(state->selected_setting_item == SETTINGS_ITEM_DRONE_METHOD) {
                state->drone_jam_method = (state->drone_jam_method + 1) % DRONE_MODE_COUNT;
            } else if(state->selected_setting_item == SETTINGS_ITEM_LOGO) {
                state->is_logo = (state->is_logo + 1) % LOGO_COUNT;
            }
            break;
        default:
            break;
    }
}

static void handle_wifi_input(PluginState* state, InputKey key) {
    switch(key) {
        case InputKeyUp:
        case InputKeyRight:
            state->wifi_channel = (state->wifi_channel % 14) + 1;
            break;
        case InputKeyDown:
        case InputKeyLeft:
            state->wifi_channel = (state->wifi_channel == 1) ? 14 : (state->wifi_channel - 1);
            break;
        default:
            break;
    }
}

int32_t nRF24_jammer_app(void* p) {
    UNUSED(p);
    PluginState* state = malloc(sizeof(PluginState));
    FuriMessageQueue* queue = furi_message_queue_alloc(8, sizeof(PluginEvent));
    
    state->mutex = furi_mutex_alloc(FuriMutexTypeNormal);
    state->notifications = furi_record_open(RECORD_NOTIFICATION);
    
