trollmaster419/Flipper-Zero-ESP32-Port/applications_user/nRF24_jammer/nRF24_jammer.c
    settings_load(state);
    
    state->is_running = false;
    state->is_stop = true;
    state->is_modules_connected = false;
    state->wifi_menu_active = false;
    state->wifi_channel_select = false;
    state->show_jamming_started = false;
    state->settings_menu_active = false;
    state->ble_menu_active = false;
    state->ble_selected = 0;
    state->current_menu = MENU_BLUETOOTH;
    state->wifi_mode = WIFI_MODE_ALL;
    state->misc_state = MISC_STATE_IDLE;
    state->misc_mode = MISC_MODE_CHANNEL_SWITCHING;
    state->wifi_channel = 1;
    state->misc_start = 0;
    state->misc_stop = 0;
    state->selected_setting_item = SETTINGS_ITEM_SPI_MODE;
    state->len_modules = 0;
    state->held_key = InputKeyMAX;
    state->hold_counter = 0;
    state->last_up_press_time = 0;
    state->last_down_press_time = 0;
    state->up_press_count = 0;
    state->down_press_count = 0;
    
    if(!furi_hal_power_is_otg_enabled()) furi_hal_power_enable_otg();

    Gui* gui = furi_record_open(RECORD_GUI);
    state->view_port = view_port_alloc();
    view_port_draw_callback_set(state->view_port, render_logo, state);
    gui_add_view_port(gui, state->view_port, GuiLayerFullscreen);
    view_port_update(state->view_port);
    if (state->is_logo == SHOW_LOGO)
        furi_delay_ms(2000);
    view_port_draw_callback_set(state->view_port, render_callback, state);
    view_port_input_callback_set(state->view_port, input_callback, queue);
    
    gui_add_view_port(gui, state->view_port, GuiLayerFullscreen);
    
    state->thread = furi_thread_alloc_ex("nRFJammer", 1024, jam_thread, state);

    /* ESP32-Port (T-Embed): Der nRF24 hängt fest verlötet am geteilten SPI2-Bus
     * (HW-Handle furi_hal_spi_bus_handle_nrf24, CS-gemuxt, läuft über den globalen
     * Bus-Lock) mit CS=GPIO44 (gpio_nrf24_cs) und CE=GPIO43. Der Original-Flipper-Pfad
     * über furi_hal_spi_bus_handle_external (Bitbang auf GPIO 9/10/11) kollidiert mit
     * der SD-Karte/LCD und wird daher nicht benutzt. Es gibt nur ein Modul -> alle
     * Multi-Modul-/EXTRA-Varianten kollabieren auf Single-Modul. */
    static const GpioPin nrf24_ce_pin = {.port = NULL, .pin = 43}; /* T-Embed: GPIO43 */
    if(true) {
        nrf24_dev[0].spi_handle = (FuriHalSpiBusHandle*) &furi_hal_spi_bus_handle_nrf24;
        nrf24_dev[0].initialized = false;
        nrf24_dev[0].ce_pin = &nrf24_ce_pin;
        nrf24_dev[0].cs_pin = &gpio_nrf24_cs;
        nrf24_init(&nrf24_dev[0]);
        for(uint8_t i = 1; i < MAX_NRF24; i++) {
            nrf24_dev[i].initialized = false;
        }
    }

    PluginEvent event;
    bool running = true;
    uint32_t last_tick = furi_get_tick();

    while(running) {
        FuriStatus status = furi_message_queue_get(queue, &event, 50);
        uint32_t current_tick = furi_get_tick();
        
        if(!state->is_modules_connected) {
            /* ESP32-Port (T-Embed): nur Modul 0 ist initialisiert (ein nRF24);
             * Module 1-3 haben handle/cs_pin = NULL -> nicht scannen. */
            uint8_t max_check = 1;
            for(uint8_t i = 0; i < max_check; i++) {
                if(nrf24_check_connected(&nrf24_dev[i])) state->len_modules++;
            }
            view_port_update(state->view_port);
            furi_delay_ms(100);
            if(state->len_modules > 0) {
                for(uint8_t i = 0; i < state->len_modules; i++) {
                    if(!nrf24_check_connected(&nrf24_dev[i])) state->len_modules--;
                }
                view_port_update(state->view_port);
                furi_delay_ms(2000); 
                state->is_modules_connected = true;
                view_port_update(state->view_port);
            }
        }

        if(current_tick - last_tick >= HOLD_DELAY_MS) {
            last_tick = current_tick;
            if(state->held_key != InputKeyMAX && !state->is_running) {
                state->hold_counter++;
                if(state->hold_counter >= 3) {
                    if(state->current_menu == MENU_MISC && state->misc_state != MISC_STATE_IDLE) {
                        if(state->held_key == InputKeyUp || state->held_key == InputKeyDown) {
                            handle_settings_input(state, state->held_key, true);
                            view_port_update(state->view_port);
                        }
                    } else if(state->current_menu == MENU_WIFI && state->wifi_channel_select) {
                        if(state->held_key == InputKeyUp || state->held_key == InputKeyDown || 
                           state->held_key == InputKeyLeft || state->held_key == InputKeyRight) {
                            handle_wifi_input(state, state->held_key);
                            view_port_update(state->view_port);
                        }
                    } else if(state->current_menu == MENU_SETTINGS && state->settings_menu_active) {
                        if(state->held_key == InputKeyUp || state->held_key == InputKeyDown) {
                            handle_settings_menu_input(state, state->held_key);
                            view_port_update(state->view_port);
                        }
                    }
                }
            }
        }

        if(status == FuriStatusOk && event.type == EVENT_KEY) {
            if(event.input.type == InputTypePress) {
                switch(event.input.key) {
                case InputKeyUp:
                    state->held_key = InputKeyUp;
                    state->hold_counter = 0;
                    if(!state->is_running && state->is_modules_connected) {
                        if(state->current_menu == MENU_MISC && state->misc_state != MISC_STATE_IDLE) {
                            handle_settings_input(state, InputKeyUp, false);
                            view_port_update(state->view_port);
                        } else if(state->current_menu == MENU_WIFI && state->wifi_menu_active) {
                            if(state->wifi_channel_select) {
                                handle_wifi_input(state, InputKeyUp);
                            } else {
                                state->wifi_mode = (state->wifi_mode + 1) % WIFI_MODE_COUNT;
                            }
                        } else if(state->current_menu == MENU_SETTINGS && state->settings_menu_active) {
                            handle_settings_menu_input(state, InputKeyUp);
                            view_port_update(state->view_port);
                        } else if(state->current_menu == MENU_BLE && state->ble_menu_active) {
                            state->ble_selected = (state->ble_selected == 0) ? 1 : 0;
                            view_port_update(state->view_port);
                        } else {
                            handle_menu_input(state, InputKeyUp);
                        }
                    }
                    break;

