trollmaster419/Flipper-Zero-ESP32-Port/applications_user/nRF24_jammer/nRF24_jammer.c
                case InputKeyDown:
                    state->held_key = InputKeyDown;
                    state->hold_counter = 0;
                    if(!state->is_running && state->is_modules_connected) {
                        if(state->current_menu == MENU_MISC && state->misc_state != MISC_STATE_IDLE) {
                            handle_settings_input(state, InputKeyDown, false);
                            view_port_update(state->view_port);
                        } else if(state->current_menu == MENU_WIFI && state->wifi_menu_active) {
                            if(state->wifi_channel_select) {
                                handle_wifi_input(state, InputKeyDown);
                            } else {
                                if(state->wifi_mode == 0) {
                                    state->wifi_mode = WIFI_MODE_COUNT - 1;
                                } else {
                                    state->wifi_mode--;
                                }
                            }
                        } else if(state->current_menu == MENU_SETTINGS && state->settings_menu_active) {
                            handle_settings_menu_input(state, InputKeyDown);
                            view_port_update(state->view_port);
                        } else if(state->current_menu == MENU_BLE && state->ble_menu_active) {
                            state->ble_selected = (state->ble_selected == 0) ? 1 : 0;
                            view_port_update(state->view_port);
                        } else {
                            handle_menu_input(state, InputKeyDown);
                        }
                    }
                    break;

                case InputKeyOk:
                    uint8_t count = 0;
                    if(!state->is_running) {
                        for(uint8_t i = 0; i < state->len_modules; i++) {
                            if(!nrf24_check_connected(&nrf24_dev[i])) count++;
                        }
                    }
                    if(count == state->len_modules && state->is_modules_connected) {
                        notification_message(state->notifications, &error_sequence);
                        state->len_modules = 0;
                        state->is_modules_connected = false;
                    } else if(!state->is_running && state->is_modules_connected) {
                        if(state->current_menu == MENU_MISC) {
                            if(state->misc_state == MISC_STATE_IDLE) {
                                state->misc_state = MISC_STATE_SET_START;
                                state->misc_start = 0;
                                state->misc_stop = 1;
                            } else if(state->misc_state == MISC_STATE_SET_START) {
                                state->misc_state = MISC_STATE_SET_STOP;
                                if(state->misc_start + 1 <= 125) {
                                    state->misc_stop = state->misc_start + 1;
                                }
                            } else if(state->misc_state == MISC_STATE_SET_STOP) {
                                if(state->misc_stop > state->misc_start) {
                                    state->show_jamming_started = true;
                                    furi_thread_start(state->thread);
                                } else {
                                    state->misc_state = MISC_STATE_ERROR;
                                    notification_message(state->notifications, &error_sequence);
                                }
                            } else if(state->misc_state == MISC_STATE_ERROR) {
                                state->misc_state = MISC_STATE_SET_STOP;
                            }
                        } else if(state->current_menu == MENU_WIFI) {
                            if(state->wifi_menu_active) {
                                if(state->wifi_channel_select) {
                                    furi_thread_start(state->thread);
                                } else {
                                    if(state->wifi_mode == WIFI_MODE_SELECT) {
                                        state->wifi_channel_select = true;
                                    } else {
                                        furi_thread_start(state->thread);
                                    }
                                }
                            } else {
                                state->wifi_menu_active = true;
                            }
                        } else if(state->current_menu == MENU_SETTINGS) {
                            if(state->settings_menu_active) {
                                settings_save(state);
                                notification_message_block(state->notifications, &sequence_success);
                            } else {
                                state->settings_menu_active = true;
                            }
                        } else if(state->current_menu == MENU_BLE) {
                            if(state->ble_menu_active) {
                                furi_thread_start(state->thread);
                            } else {
                                state->ble_menu_active = true;
                            }
                        } else {
                            furi_thread_start(state->thread);
                        }
                    }
                    break;

                case InputKeyBack:
                    if(state->is_running) {
                        state->is_stop = true;
                        furi_thread_join(state->thread);
                        if(state->current_menu == MENU_MISC) {
                            state->show_jamming_started = false;
                        }
                        if(state->current_menu == MENU_BLE) {
                            state->ble_menu_active = true;
                        }
                    } else if(state->current_menu == MENU_MISC) {
                        if(state->misc_state == MISC_STATE_SET_STOP) {
                            state->misc_state = MISC_STATE_SET_START;
                        } else if(state->misc_state == MISC_STATE_SET_START) {
                            state->misc_state = MISC_STATE_IDLE;
                        } else {
                            running = false;
                        }
                    } else if(state->current_menu == MENU_WIFI && state->wifi_menu_active) {
                        if(state->wifi_channel_select) {
                            state->wifi_channel_select = false;
                        } else {
                            state->wifi_menu_active = false;
                        }
                    } else if(state->current_menu == MENU_SETTINGS) {
                        if(state->settings_menu_active) {
                            settings_save(state);
                            state->settings_menu_active = false;
                        } else {
                            running = false;
                        }
                    } else if(state->current_menu == MENU_BLE) {
                        if(state->ble_menu_active) {
                            state->ble_menu_active = false;
                        } else {
                            running = false;
                        }
                    } else {
                        running = false;
                    }
                    break;

                case InputKeyLeft:
                    state->held_key = InputKeyLeft;
                    state->hold_counter = 0;
                    if(!state->is_running && state->is_modules_connected) {
                        if(state->current_menu == MENU_MISC && state->misc_state != MISC_STATE_IDLE) {
                            if(state->misc_mode == 0) {
                                state->misc_mode = MISC_MODE_COUNT - 1;
                            } else {
                                state->misc_mode--;
                            }
                        } else if(state->current_menu == MENU_WIFI && state->wifi_menu_active) {
                            if(state->wifi_channel_select) {
                                handle_wifi_input(state, InputKeyLeft);
                            } else {
                                if(state->wifi_mode == 0) {
                                    state->wifi_mode = WIFI_MODE_COUNT - 1;
                                } else {
                                    state->wifi_mode--;
                                }
                            }
                        } else if(state->current_menu == MENU_SETTINGS && state->settings_menu_active) {
                            handle_settings_menu_input(state, InputKeyLeft);
                            view_port_update(state->view_port);
                        } else {
                            handle_menu_input(state, InputKeyLeft);
                        }
                    }
                    break;

